---
title: "Delete Duplicates In pandas"
author: "Chris Albon"
date: 2017-12-20T11:53:49-07:00
description: "Delete duplicates in pandas."
type: technical_note
draft: false
---

### import modules

In [1]:
import pandas as pd

### Create dataframe with duplicates

In [2]:
raw_data = {'first_name': ['Jason', 'Jason', 'Jason','Tina', 'Jake', 'Amy'], 
        'last_name': ['Miller', 'Miller', 'Miller','Ali', 'Milner', 'Cooze'], 
        'age': [42, 42, 1111111, 36, 24, 73], 
        'preTestScore': [4, 4, 4, 31, 2, 3],
        'postTestScore': [25, 25, 25, 57, 62, 70]}
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'preTestScore', 'postTestScore'])
df

  first_name last_name      age  preTestScore  postTestScore
0      Jason    Miller       42             4             25
1      Jason    Miller       42             4             25
2      Jason    Miller  1111111             4             25
3       Tina       Ali       36            31             57
4       Jake    Milner       24             2             62
5        Amy     Cooze       73             3             70

### Identify which observations are duplicates

In [3]:
df.duplicated()

0    False
1     True
2    False
3    False
4    False
5    False
dtype: bool

### Drop duplicates

In [4]:
df.drop_duplicates()

  first_name last_name      age  preTestScore  postTestScore
0      Jason    Miller       42             4             25
2      Jason    Miller  1111111             4             25
3       Tina       Ali       36            31             57
4       Jake    Milner       24             2             62
5        Amy     Cooze       73             3             70

### Drop duplicates in the first name column, but take the last obs in the duplicated set

In [5]:
df.drop_duplicates(['first_name'], keep='last')

  first_name last_name      age  preTestScore  postTestScore
2      Jason    Miller  1111111             4             25
3       Tina       Ali       36            31             57
4       Jake    Milner       24             2             62
5        Amy     Cooze       73             3             70

In [6]:
df.drop_duplicates(['first_name'])

  first_name last_name  age  preTestScore  postTestScore
0      Jason    Miller   42             4             25
3       Tina       Ali   36            31             57
4       Jake    Milner   24             2             62
5        Amy     Cooze   73             3             70

In [18]:
print(df.isnull())
print(df.notnull())
print(df.notna())
print(df.isnull().sum())
print(df.isnull().any())
print(df.info())
import numpy as np; np.NaN

   first_name  last_name    age  preTestScore  postTestScore
0       False      False  False         False          False
1       False      False  False         False          False
2       False      False  False         False          False
3       False      False  False         False          False
4       False      False  False         False          False
5       False      False  False         False          False
   first_name  last_name   age  preTestScore  postTestScore
0        True       True  True          True           True
1        True       True  True          True           True
2        True       True  True          True           True
3        True       True  True          True           True
4        True       True  True          True           True
5        True       True  True          True           True
   first_name  last_name   age  preTestScore  postTestScore
0        True       True  True          True           True
1        True       True  True          True           True
2        True       True  True          True           True
3        True       True  True          True           True
4        True       True  True          True           True
5        True       True  True          True           True
first_name       0
last_name        0
age              0
preTestScore     0
postTestScore    0
dtype: int64
first_name       False
last_name        False
age              False
preTestScore     False
postTestScore    False
dtype: bool
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
first_name       6 non-null object
last_name        6 non-null object
age              6 non-null int64
preTestScore     6 non-null int64
postTestScore    6 non-null int64
dtypes: int64(3), object(2)
memory usage: 320.0+ bytes
None

nan